# YOLOv10n with Dual Coordinate Attention Placement
# ============================================================================
# Research-optimized dual CA placement adapted for YOLOv10n architecture
# Maintains YOLOv10n's unique features (SCDown, PSA) while adding dual CA

# Parameters
nc: 6 # number of classes (HRIPCB dataset)
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]

# YOLOv10n backbone with DUAL Coordinate Attention placement
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f_CoordAtt, [128, True]] # 2 - SHALLOW CA: Early-stage position encoding
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 6, C2f, [256, True]]          # 4 - Standard C2f
  - [-1, 1, SCDown, [512, 3, 2]]       # 5-P4/16 (YOLOv10n SCDown)
  - [-1, 6, C2f_CoordAtt, [512, True]] # 6 - DEEP CA: Mid-level position encoding
  - [-1, 1, SCDown, [1024, 3, 2]]      # 7-P5/32 (YOLOv10n SCDown)
  - [-1, 3, C2f, [1024, True]]         # 8 - Standard C2f
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 1, PSA, [1024]]               # 10 (YOLOv10n PSA module)

# YOLOv10n head - Preserving YOLOv10n architecture
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, v10Detect, [nc]] # YOLOv10n Detect(P3, P4, P5)