# YOLOv10n with Coordinate Attention
# ============================================================================
# YOLOv10n architecture with CoordAtt attention integration

# Parameters
nc: 6 # number of classes (HRIPCB dataset)
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]

# YOLOv10n backbone with CoordAtt attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_CoordAtt, [128, True]] # 2 - Enhanced with CoordAtt
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_CoordAtt, [256, True]] # 4 - Enhanced with CoordAtt
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16 (YOLOv10n SCDown)
  - [-1, 6, C2f_CoordAtt, [512, True]] # 6 - Enhanced with CoordAtt
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32 (YOLOv10n SCDown)
  - [-1, 3, C2f_CoordAtt, [1024, True]] # 8 - Enhanced with CoordAtt
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10 (YOLOv10n PSA module)

# YOLOv10n head with CoordAtt attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f_CoordAtt, [512]] # 13 - Enhanced with CoordAtt

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f_CoordAtt, [256]] # 16 (P3/8-small) - Enhanced with CoordAtt

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f_CoordAtt, [512]] # 19 (P4/16-medium) - Enhanced with CoordAtt

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f_CoordAtt, [1024, True, True]] # 22 (P5/32-large) - Enhanced with CoordAtt

  - [[16, 19, 22], 1, v10Detect, [nc]] # YOLOv10n Detect(P3, P4, P5)