# YOLOv11n with Dual Coordinate Attention Placement
# ============================================================================
# Research-optimized dual CA placement adapted for YOLOv11n architecture
# Latest YOLO architecture with enhanced dual coordinate attention

# Parameters
nc: 6 # number of classes (HRIPCB dataset)
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024] # YOLOv11n scaling (matches original)

# YOLOv11n backbone with DUAL Coordinate Attention placement
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                  # 1-P2/4
  - [-1, 2, C3k2_CoordAtt, [256, False, 0.25]]  # 2 - SHALLOW CA: Early position encoding (P2/4)
  - [-1, 1, Conv, [256, 3, 2]]                  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]           # 4 - Standard C3k2
  - [-1, 1, Conv, [512, 3, 2]]                  # 5-P4/16
  - [-1, 2, C3k2_CoordAtt, [512, True]]         # 6 - DEEP CA: Mid-level position encoding
  - [-1, 1, Conv, [1024, 3, 2]]                 # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]                 # 8 - Standard C3k2
  - [-1, 1, SPPF, [1024, 5]]                    # 9
  - [-1, 2, C2PSA, [1024]]                      # 10 - YOLOv11n PSA module

# YOLOv11n head - Standard configuration (preserving YOLOv11n architecture)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)